import numpy as np

coatings = (
    "Асфальтное",
    "Бетонное",
    "Гравийное"
)
liftings = (
    "< 5.5 тонн",
    ">= 5.5 тонн"
)

allowed_speed = (
    (110 * 3.6, 90 * 3.6),
    (90 * 3.6, 70 * 3.6),
    (85 * 3.6, 60 * 3.6)
)

# road_lines = (
#     "Однополосная",
#     "Двухполосная"
# )

brand_chars = ( # dBrand
    (10,4, .2918, .290),
    (4.5, .5, .2326, .52),
    (3, .5, .1613, .680),
    (7, 1.3, .0924, .77),
    (4, .2, .0552, .83),
    (3, 1.25, .053, .88),
    (5, .8, .0325, .915),
    (9, 1, .03, .945),
    (5, 1.5, .024, 1)
)
brands = (
    "КАМАЗ",
    "ГАЗ",
    "ЗИЛ",
    "МАЗ",
    "Урал",
    "САЗ",
    "Volvo",
    "MAN",
    "Scania",
    "Mercedes Benz",
)


S = 30
Tk = 60 * 60 * 18
dt = 120
regimes = 6
N = 1000
lambda_ = .056
dTb = 3.6
dv = 20 * 3.6
